<template>
    <div style="width: 90%;margin: 0 auto;">
       <pre>
    1. 我们会遵循《隐私政策》收集使用信息，但不会仅因同意本《隐私政策》而采用强制捆绑的方式收集信息; 
    2. 为了向您提供服务所必需，需要您开启以下权限，以便您使用相应功能;若您不使用相应功能，可以不开启以下权限，不开启权限不影响您使用其他功能，我们将依法保障您的信息安全; 电话/设备信息权限 开启电话/设备信息权限，用于读取设备信息、日志信息和帮助您诊断问题,以便我们向您推送资讯以及安全风控。即使您授予我们此项权限，目前我们也不会因此获取您的电话号码或通讯簿。 存储权限 开启存储权限，用于存储应用资源文件，以便您使用保存图片、音视频文件功能，上传您存储的图片、音视频文件。 相机 开启相机权限，以便您拍摄并上传照片、视频。 麦克风 开启麦克风权限，以便您拍摄并上传音、视频。 地理位置 当您设置/编辑“个人资料”中的“所在地”、设置收件地址时，为了定位手机 位置，我们需要申请位置权限。 
    3. 未经您的同意，我们不会从第三方获取、共享或对外提供您的个人信息。 
    4. 您可以查询、访问、修改、删除您的 个人信息，我们也提供注销账号、投诉举报的渠道。
      </pre>
    </div>
</template>

<script>
  export default {
    name: 'Privacy'
  }
</script>

<style scoped>
  pre{
    font-size:24px;
    font-family:PingFangSC-Regular,PingFang SC;
    font-weight:400;
    color:rgba(51,51,51,1);
    line-height:40px;
    text-align: left;
    white-space: pre-wrap;
    word-wrap: break-word;

  }
</style>
