<template>
  <el-main>
    <el-row class="profile">
      <el-col :span="24">
        <img src="@/assets/image/profile-banner.png" alt="profile">
      </el-col>
    </el-row>
    <el-row class="profile-content">
      <el-col :span="24" class="profile-tags">
        <el-tabs v-model="activeName" @tab-click="handleClick">
          <el-tab-pane label="服务协议" name="agreement">
               <pre>
        全民体育（以下称“我们”）尊重并保护您的隐私，当您使用我们的服务时，我们可能会收集、使用、储存和分享您的相关信息。
        我们希望通过本《隐私政策》（ 以下称 “本政策”）向您说明，我们如何收集、使用、储存和分享这些信息，我们如何为您提供访问、更新、控制和保护您信息的服务。
        本政策与您使用我们的服务紧密相关，我们希望您仔细阅读本政策的全部内容，作出您认为适当的选择。我们努力用简明扼要的文字表达，并对本政策中与您的权益存在重大关系的条款，在此提示您特别注意。
        您使用或继续使用我们的服务，即表示您同意我们按照本政策收集、使用、储存和分享您的信息。
        如您不同意本政策及未来修订版本的任何条款，请您不要使用我们的服务。
        一、使用者使用服务限制
        全民体育严禁使用者利用我们提供的服务做与软件目的无关之行为，包括妨害他人名誉或隐私权；或使用自己、匿名或冒用他人或全民体育及其关联公司名义散播诽谤、不实、威胁、不雅、猥亵、不法、攻击性或侵害他人权利的消息或文字，传播色情或其他违反社会公德的言论；传输或散布计算机病毒；从事广告或贩卖商品；从事不法交易或张贴虚假不实或引人反罪的信息；使用软件内通讯方式、聊天系统或任何传达方式来传播广告；或任何违反中华人民共和国法律或其他法令的行为，亦不得利用网络社交的机会，与其他用户或他人进行非法的交涉或对话，若违反相关使用服务限制可能会导致您的账号被暂停或删除。
        二、我们可能收集的信息
        我们提供服务时，可能会收集、储存和使用下列与您相关的信息。如果您不提供相关信息，可能无法注册成为我们的用户或无法享受我们提供的某些服务，或者即便我们可以继续向您提供一些服务，可能也无法达到该服务拟达到的效果。
        您提供给我们的信息
        您在注册我们的账户或使用我们的服务时，向我们提供的相关个人信息（指以电子或者其他方式记录的能够单独或者与其他信息结合识别自然人个人身份的各种信息。），例如您的姓名、位置、身份证信息、电话号码、电子邮件等； 您通过我们的服务向其他方提供的共享信息，以及您使用我们的服务时所储存的信息。
        其他方分享的您的信息
        其他方使用我们的服务时所提供有关您的共享信息。
        我们获取的您的信息
        您使用我们的服务时，我们可能收集如下信息：
        1、日志信息， 指您使用我们的服务时，系统可能会通过cookies、或其他方式自动采集的技术信息，包括：
        （1）设备或软件信息，例如您的移动设备、网页浏览器或您用于接入我们服务的其他程序所提供的配置信息、您的IP地址和您的移动设备所用的版本和设备标识符；
        （2）您在使用我们服务时搜索和浏览的信息，例如您使用的网页搜索词语、访问的社交媒体页面url地址，以及您在使用我们服务时浏览或要求提供的其他信息和内容详情；
        （3）有关您曾使用的移动应用（APP）和其他软件的信息，以及您曾经使用该等移动应用和软件的信息；
        （4）您通过我们的服务进行通讯的信息，例如曾通讯的账号，以及通讯时间、数据和时长；
        （5）您通过我们的服务分享的内容所包含的信息（元数据），例如拍摄或上传的共享照片或录像的日期、时间或地点等。
        2、网络信息， 指您在联网状态下使用我们的服务时，我们为了解使用者的运营商和网络分布的情况，收集的有关运营商名称与网络类型，此外，我们还收集接入WiFi名称和WiFi接入时间以了解您使用服务的使用者场景。
        3、位置信息， 指您开启设备定位功能并使用我们基于位置提供的相关服务时，我们收集的有关您位置的信息，这些信息有助于我们了解用户分布和用户使用场景，使我们可以为其提供正确的应用程序版本及更优质的服务，包括：
        您通过具有定位功能的移动设备使用我们的服务时，我们通过GPS或WiFi等方式收集的您的地理位置信息；
        您可以通过关闭定位功能，停止我们对您的地理位置信息的收集。
        4、手机输入设备信息， 指您使用我们的服务时，需要利用设备进行信息输入，包括：
        （1）摄像头信息指您开启摄像头并使我们基于您的图像信息提供相关服务时，我们收集您的摄像头图像信息。例如进行二维码扫描，录制视频上传等功能时，摄像头获取到的图像信息；
        （2）语音信息指您提供语音信息并使我们基于您的语音信息提供相关服务时，我们收集您的语音输入信息。例如您在进行语音搜索时，获取到您的语音输入信息；
        （3）您可以通过手机权限管理关闭相关权限，但是会影响我们服务中部分功能的使用。
        5、手机内容信息， 指您在使用我们服务时，系统会收集您手机设备的信息，包括：
        （1）手机状态信息指您手机设备硬件和软件的信息，包括设备号，手机型号，系统版本等；
        （2）手机帐户信息指您手机登录帐户的信息，例如在您选择使用手机账户登录我们的服务时，会获取您的手机帐户信息。
        三、我们可能如何使用信息
        我们可能将在向您提供服务的过程之中所收集的信息用作下列用途：
        1、向您提供服务；
        2、在我们提供服务时，用于身份验证、客户服务、安全防范、诈骗监测、存盘和备份用途，确保我们向您提供的产品和服务的安全性；说明我们设计新服务，改善我们现有服务；
        3、使我们更加了解您如何接入和使用我们的服务，从而针对性地响应您的个性化需求，例如语言设定、位置设定、个性化的说明服务和指示，或对您和其他使用我们服务的使用者作出其他方面的响应；
        4、向您提供与您更加相关的广告以替代普遍投放的广告；
        5、评估我们服务中的广告和其他促销及推广活动的效果，并加以改善；
        6、软件认证或管理软件升级；
        7、让您参与有关我们产品和服务的调查。
        为了让您有更好的体验、改善我们的服务或您同意的其他用途，在符合相关法律法规的前提下，我们可能将通过我们的某一项服务所收集的信息，以汇集信息或者个性化的方式，用于我们的其他服务。例如，在您使用我们的一项服务时所收集的信息，可能在另一服务中用于向您提供特定内容，或向您展示与您相关的、非普遍推送的信息。如果我们在相关服务中提供了相应选项，您也可以授权我们将该服务所提供和储存的信息用于我们的其他服务。
        四、您如何管理您的个人信息
        我们将尽一切可能采取适当的技术手段，保证您可以访问、更新和更正自己的注册信息或使用我们的服务时提供的其他个人信息。在访问、更新、更正和删除前述信息时，我们可能会要求您进行身份验证，以保障账户安全。
        五、我们可能如何分享信息
        除以下情形外，未经您同意，我们以及我们的关联公司不会与任何第三方分享您的个人信息：
        1、我们以及我们的关联公司，可能将您的个人信息与我们的关联公司、合作伙伴及第三方服务供货商、承包商及代理（例如代表我们发出电子邮件或推送通知的通讯服务提供商、为我们提供位置数据的地图服务供货商）分享（他们可能并非位于您所在的法域），用作下列用途：
        （1）向您提供我们的服务；
        （2）实现“我们可能如何使用信息”部分所述目的；
        （3）履行我们在《用户协议》或本政策中的义务和行使我们的权利；
        （4）理解、维护和改善我们的服务。
        如我们或我们的关联公司与任何上述第三方分享您的个人信息，我们将努力确保该等第三方在使用您的个人信息时遵守本政策及我们要求其遵守的其他适当的保密和安全措施。
        随着我们业务的持续发展，我们以及我们的关联公司有可能进行合并、收购、资产转让或类似的交易，您的个人信息有可能作为此类交易的一部分而被转移。我们将在转移前通知您。
        2、我们或我们的关联公司还可能为以下需要而保留、保存或披露您的个人信息：
        （1）遵守适用的法律法规；
        （2）遵守法院命令或其他法律程序的规定；
        （3）遵守相关政府机关的要求；
        为遵守适用的法律法规、维护社会公共利益，或保护我们的客户、我们或我们的集团公司、其他用户或雇员的人身和财产安全或合法权益所合理必需的用途。
        六、我们可能如何收集信息
        我们，可能通过cookies等方式收集和使用您的信息，并将该等信息储存为日志信息。
        我们使用自己的 cookies，目的是为您提供更个性化的使用者体验和服务，并用于以下用途：
        1、记住您的身份。例如：cookies 有助于我们辨认您作为我们的注册用户的身份，或保存您向我们提供的有关您的喜好或其他信息；
        2、分析您使用我们服务的情况。例如，我们可利用 cookies来了解您使用我们的服务进行什么活动、或哪些网页或服务最受您的欢迎；
        3、广告优化。cookies有助于我们根据您的信息，向您提供与您相关的广告而非进行普遍的广告投放。
        我们为上述目的使用 cookies 的同时，可能将通过 cookies 收集的非个人身份信息，经统计加工后提供给广告商或其他合作伙伴，用于分析使用者如何使用我们的服务，并用于广告服务。
        我们的产品和服务上可能会有广告商或其他合作方放置的 cookies 。这些 cookies 可能会收集与您相关的非个人身份信息，以用于分析使用者如何使用该等服务、向您发送您可能感兴趣的广告，或用于评估广告服务的效果。这些第三方 cookies 收集和使用该等信息，不受本政策约束，而是受相关使用者的隐私政策约束，我们不对第三方的 cookies 承担责任。
        您可以通过浏览器设置拒绝或管理 cookies。但请注意，如果停用cookies，您有可能无法享受最佳的服务体验，某些服务也可能无法正常使用。同时，您还会收到同样数量的广告，但这些广告与您的相关性会降低。
        七、信息安全
        我们仅在本政策所述目的所必需的期间和法律法规要求的时限内保留您的个人信息。
        我们使用各种安全技术和程序，以防信息的丢失、不当使用、未经授权阅览或披露。例如，在某些服务中，我们将利用加密技术（例如SSL）来保护您提供的个人信息。但请您理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安全措施，也不可能始终保证信息百分之百的安全。您需要了解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的因素而出现问题。
        八、您分享的信息
        我们的多项服务，可让您不仅与您的社交网络、也与使用该服务的所有使用者公开分享您的相关信息，例如，您在我们的服务中所上传或发布的信息（包括您公开的个人信息、您建立的名单）、您对其他人上传或发布的信息作出的响应，以及包括与这些信息有关的位置数据和日志信息。使用我们服务的其他使用者也有可能分享与您有关的信息（包括位置数据和日志信息）。特别是，我们的社交媒体服务，是专为使您可以与世界各地的用户共享信息而设计，您可以使共享信息实时、广泛地传递。只要您不删除共享信息，有关信息会一直留存在公共领域；即使您删除共享信息，有关信息仍可能由其他用户或不受我们控制的非关联第三方独立地缓存、复制或储存，或由其他使用者或该等第三方在公共领域保存。
        因此，请您谨慎考虑通过我们的服务上传、发布和交流的信息内容。在一些情况下，您可通过我们某些服务的隐私设定来控制有权浏览您的共享信息的用户范围。如要求从我们的服务中删除您的相关信息，请通过该等特别服务条款提供的方式操作。
        九、您分享的敏感个人信息
        某些个人信息因其特殊性可能被认为是敏感个人信息，例如您的种族、宗教、个人健康和医疗信息等。相比其他个人信息，敏感个人信息受到更加严格的保护。
        请注意，您在我们的服务中所提供、上传或发布的内容和信息（例如有关您社交活动的照片等信息），可能会泄露您的敏感个人信息。您需要谨慎地考虑，是否在使用我们的服务时披露相关敏感个人信息。
        您同意按本政策所述的目的和方式来处理您的敏感个人信息。
        十、我们可能向您发送的信息
        1、信息推送：您在使用我们的服务时，我们可能使用您的信息向您的设备发送新闻或推送通知。如您不希望收到这些信息，可在设备上选择取消相关权限或关闭相关提示。
        2、与服务有关的公告：我们可能在必要时（例如因系统维护而暂停某一项服务时）向您发出与服务有关的公告。您可能无法取消这些与服务有关、性质不属于推广的公告。
        十一、对第三方责任的声明
        请您注意，我们的服务可能包括或连结至第三方提供的社交媒体或其他服务（包括网站）。例如：
        1、您利用"分享"键将某些内容分享到我们的服务，或您利用第三方联机服务登录我们的服务。这些功能可能会收集您的相关信息（包括您的日志信息），并可能在您的设备装置 cookies，从而正常运行上述功能；
        2、我们通过广告或我们服务的其他方式向您提供连结，使您可以接入第三方的服务或网站。
        3、该等第三方社交媒体或其他服务可能由相关的第三方或我们运营。您使用该等第三方的社交媒体服务或其他服务（包括您向该等第三方提供的任何个人信息），须受该第三方的服务条款及隐私政策约束，您需要仔细阅读其条款。本政策仅适用于我们所收集的信息，并不适用于任何第三方提供的服务或第三方的信息使用规则，我们对任何第三方使用由您提供的信息不承担任何责任。
        十二、未成年人隐私权特别约定
        我们不会有意向未满十八周岁（或者其他您所在地区使用法律规定的年龄）的未成年人收集信息，如果您是未成年人，请不要向我们发送您的个人信息，包括您的姓名、地址、电子邮件、电话号码等。我们鼓励父母或监护人指导未成年人使用我们的服务。如果您为未成年人， 建议请您的父母或监护人阅读本政策，并在征得您父母或监护人同意的前提下使用我们的服务或向我们提供您的信息。如您的父母或监护人不同意您按照本政策使用我们的服务或向我们提供信息，请您立即终止使用我们的服务并及时通知我们，以便我们采取相应的措施。
        十三、隐私政策的适用范围及修订
        除某些特定服务外，我们所有的服务均适用本政策。这些特定服务将适用特定的隐私政策。针对某些特定服务的特定隐私政策，将更具体地说明我们在该等服务中如何使用您的信息。该特定服务的隐私政策构成本政策的一部分。如相关特定服务的隐私政策与本政策有不一致之处，适用该特定服务的隐私政策。
        请您注意，本政策不适用于以下情况：
        （1）通过我们的服务而接入的第三方服务（包括任何第三方网站）收集的信息；
        （2）过在我们服务中进行广告服务的其他公司或机构所收集的信息。
        为给您提供更好的服务以及随着我们业务的发展，我们可能会适时对本政策进行修订，如本政策发生变更，我们将以推送通知或发送邮件或站内信通知您，若您在本政策修订后继续使用我们的服务，即表示您已充分阅读、理解并同意接受经修订后的本政策的约束。
               </pre>
          </el-tab-pane>
          <el-tab-pane label="隐私政策" name="privacy">
                <pre>
1. 我们会遵循《隐私声明》收集使用信息，但不会仅因同意本《隐私声明》而采用强制捆绑的方式收集信息。
2. 为了向您提供服务所必需，需要您开启以下权限，以便您使用相应功能;若您不使用相应功能，可以不开启以下权限，不开启权限不影响您使用其他功能，我们将依法保障您的信息安全：
<strong>电话 / 设备信息权限</strong>
开启电话/设备信息权限，用于读取设备信息、日志信息和帮助您诊断问题,以便我们向您推送资讯以及安全风控。即使您授予我们此项权限，目前我们也不会因此获取您的电话号码或通讯簿。
<strong>存储权限</strong>
开启存储权限，用于存储应用资源文件，以便您使用保存图片、音视频文件功能，上传您存储的图片、音视频文件。
<strong>相机</strong>
开启相机权限，以便您拍摄并上传照片、视频。
<strong>麦克风</strong>
开启麦克风权限，以便您拍摄并上传音、视频。
<strong>地理位置</strong>
当您设置/编辑“个人资料”中的“所在地”、设置收件地址时，为了定位手机 位置，我们需要申请位置权限。
3. 未经您的同意，我们不会从第三方获取、共享或对外提供您的个人信息。
4. 您可以查询、访问、修改、删除您的 个人信息，我们也提供注销账号、投诉举报的渠道。
<strong>公司资料</strong>
名称：上海辣森网络科技有限公司
注册地：上海市虹口区塘沽路309号14层C室（集中登记地）
常用办公地址：上海市普陀区中山北路3300号环球港B座15楼1511室
信息保护负责人联系电话：13482207807
              </pre>
          </el-tab-pane>
          <el-tab-pane label="关于全民体育" name="about">
               <pre>
        全民体育是一款懂球迷的体育App，满足球迷对体育赛事的需求，就是全民体育对App最大的要求！
        全民体育提供完整的体坛内容，包括即时新闻、最新赛程、深度专栏、准确数据，搭配人性化又时尚的操作接口，让球迷在接收资讯之馀还享有尊绝不凡的使用体验。
        懂球迷不是随便说说！全民体育打造了有温度的人工智能系统，将根据每位球迷的兴趣、爱好、使用习惯推荐独一无二的内容，「宾至如归」是团队唯一的目标。
        【完整资讯】体坛最新消息报导，伤病、交易、访谈、球员表现、花边，所有资讯一手掌握。 
        【深度专栏】全民体育不接受粗制滥造的内容，以最高规格要求带给球迷最专业的赛事解析。 
        【最新赛程】不错过任何一场比赛！文字直播搭配比赛聊天室，所有球迷一起热血享受比赛。 
        【准确数据】力求所有数据的准确性与即时性，并提供数据比较功能，让球迷能更深入解析。 
        【独一无二】提供最个人化的使用体验，让每个球迷都能感受自己是独一无二的！
              </pre>
          </el-tab-pane>
          <el-tab-pane label="投诉侵权" name="complaint">
                  <pre>
作为中立的网络服务提供者，收到符合要求的投诉通知后，将按照相关法律法规的规定及时受理，请务必完整、准确、真实填写以下信息，以提高投诉被受理的成功率。
投诉邮箱：customer@nsnni.com
投诉分类：
1.内容涉嫌抄袭
2.内容设计侵犯知识产权
3.内容涉嫌侵犯名誉/商誉/隐私权
4.其他
侵权/违法内容链接
投诉描述
联系人姓名、身份证号码、身份证照片、手机号、联系邮箱
                </pre>
          </el-tab-pane>
        </el-tabs>
      </el-col>
    </el-row>
  </el-main>
</template>

<script>

  export default {
    name: 'activeName',
    components: {},
    head () {
      return {
        title: '用户协议_全民体育',
        meta: [
          {
            hid: 'keywords',
            name: 'keywords',
            content: '全民体育,全民体育资讯,全民体育新闻,全民体育视频,全民体育篮球,全民体育足球,全民体育赛事,全民体育NationalSports,全民体育直播,全民体育app'
          },
          {
            hid: 'description',
            name: 'description',
            content: '全民体育,一款为体育粉丝量身定做的APP。这里有最全面最专业的体育资讯，让体育迷们在家的氛围中获得完美的赛事体验，提供全方位、多样化的体育资讯。'
          }
        ]
      }
    },
    data () {
      return {
        activeName: 'agreement'
      }
    },
    mounted () {
      this.activeName = this.$route.params.activeName
    },
    methods: {
      handleClick (tab, event) {
        console.log(tab)
        // console.log(tab, event)
      }
    }
  }
</script>

<style scoped>
  .el-main {
    padding: 0 20px;
    width: 1440px;
  }

  .profile {
    margin-top: 4px;
  }

  .profile img {
    width: 100%;
    height: 340px;
  }

  .profile-content {

  }

  .profile-tags {
    text-align: center;
    height: 100%;
    margin-top: -6px;
  }

  /deep/ .el-tabs__nav {
    float: none !important;
  }

  /deep/ .el-tabs__header {
    height: 70px;
    background: rgba(248, 248, 248, 1);
    border: 1px solid rgba(221, 221, 221, 1);
  }

  /deep/ .el-tabs__nav {
    height: 70px;
    line-height: 70px;
  }

  /deep/ .el-tabs__active-bar {
    left: 512px;
    bottom: 15px;
  }

  #pane-agreement {
    width: 90%;
    margin: 0 auto;
    text-align: left;
    font-size: 18px;
    font-weight: 400;
    color: rgba(51, 51, 51, 1);
    line-height: 40px;
  }

  #pane-privacy {
    width: 90%;
    margin: 0 auto;
    text-align: left;
    font-size: 18px;
    font-weight: 400;
    color: rgba(51, 51, 51, 1);
    line-height: 40px;
  }

  #pane-about {
    width: 90%;
    margin: 0 auto;
    text-align: left;
    font-size: 18px;
    font-weight: 400;
    color: rgba(51, 51, 51, 1);
    line-height: 40px;
  }

  #pane-complaint {
    width: 90%;
    margin: 0 auto;
    text-align: left;
    font-size: 18px;
    font-weight: 400;
    color: rgba(51, 51, 51, 1);
    line-height: 40px;
  }

  pre {
    text-align: left;
    white-space: pre-wrap;
    word-wrap: break-word;
  }
</style>
